app/Controllers/admin/Backend.php

	public function __construct()
	{

	    $session = \Config\Services::session();
	  	$this->admin_id = $session->get('adminLogin');

         $settingModel = new SettingModel();
        $default_img = $settingModel->asObject()->where(array('key'=>'config_logo'))->first();
---
SELECT *
FROM `cyb_setting`
WHERE `key` = 'config_logo'
 LIMIT 1

  public function index()
	{


    $model = new BackendModel();
    $IndustryModel = new IndustryModel();
    $ServiceModel = new ServiceModel();
    $CareerModel = new CareerModel();
    $EnquiryModel = new EnquiryModel();
     $ProductModel = new ProductModel();



    $data['page_title'] = 'Dashboard';

    $data['admin'] = $model->asObject()->findAll();

    $data['careerCount'] = $CareerModel->countAllResults();
    $data['ServiceCount'] = $ServiceModel->countAllResults();
    $data['SolutionCount'] = $ProductModel->countAllResults();
     $data['indusryCount'] = $IndustryModel->countAllResults();

    $data['enquiryCount'] = $EnquiryModel->countAllResults();

    $data['letestProduct'] = $ServiceModel->asObject()->orderBy('id','DESC')->findAll(5);
---
SELECT *
FROM `cyb_admin`
SELECT COUNT(*) AS `numrows`
FROM `cyb_careers`
SELECT COUNT(*) AS `numrows`
FROM `cyb_services`
SELECT COUNT(*) AS `numrows`
FROM `cyb_products`
SELECT COUNT(*) AS `numrows`
FROM `cyb_industries`
SELECT COUNT(*) AS `numrows`
FROM `cyb_enquiry`
SELECT *
FROM `cyb_services`
ORDER BY `id` DESC
 LIMIT 5