app/Controllers/admin/Cms.php

    public function __construct()
    {
        $settingModel = new SettingModel();
        $default_img = $settingModel->asObject()->where(['key' => 'config_logo'])->first();
---
SELECT *
FROM `cyb_setting`
WHERE `key` = 'config_logo'
 LIMIT 1