app/Controllers/admin/Module.php

    public function __construct()
    {
        $settingModel = new SettingModel();
        $default_img = $settingModel->asObject()->where(array('key' => 'config_logo'))->first();
---
SELECT *
FROM `cyb_setting`
WHERE `key` = 'config_logo'
 LIMIT 1

  function partners(){
      $model = new PartnerModel();
    $permission = $this->AdminModel->permission($this->uri->getSegment(2));
    if(empty($permission)){
       return redirect()->to('admin/permission-denied');
    }

    $data['page_title'] = 'All Partners List';
     // pagination
    $data['perPage'] = 10;
    $data['detail'] = $model->asObject()->select('partners.*,pt.name as tag_name')->join('partertags pt','partners.tag_id=pt.id','left')->orderBy('id','asc')->paginate($data['perPage']);
    $data['page'] = isset($_GET['page']) ? $_GET['page'] : 0;

    $data['total'] = $model->countAllResults();

    $data['data'] = $model->paginate($data['perPage']);
---
SELECT COUNT(*) AS `numrows`
FROM `cyb_partners`
LEFT JOIN `cyb_partertags` `pt` ON `cyb_partners`.`tag_id`=`pt`.`id`
SELECT `cyb_partners`.*, `pt`.`name` as `tag_name`
FROM `cyb_partners`
LEFT JOIN `cyb_partertags` `pt` ON `cyb_partners`.`tag_id`=`pt`.`id`
ORDER BY `id` ASC
 LIMIT 10