app/Controllers/admin/Product.php

                        foreach ($pCardTitles as $idx => $pCardTitle) {
                            if (empty(trim($pCardTitle))) continue;

                            $db->table('product_partnership_cards')->insert([ // <-- REMOVED "cyb_"
                                'product_id'  => $id,
                                'title'       => esc($pCardTitle),
                                'description' => isset($pCardDescs[$idx]) ? esc($pCardDescs[$idx]) : '',
                                'icon_class'  => !empty($pCardIcons[$idx]) ? $pCardIcons[$idx] : 'fas fa-handshake',
                                'sort_order'  => isset($pCardSortOrders[$idx]) ? (int)$pCardSortOrders[$idx] : 0
                            ]);
---
INSERT INTO `cyb_product_partnership_cards` (`product_id`, `title`, `description`, `icon_class`, `sort_order`) VALUES ('13', 'Collaborative Growth ', 'Co-engineering Co-engineering solutions with industry leaders for best-in-class framework safety and innovation velocity.\r\n', 'fas fa-handshake', 1)

    public function delete_products(){
        $model = new ProductModel();
        if ($this->request->getVar()) {
            $id = $this->request->getVar('selected');

            if ($id) {
                $db = \Config\Database::connect();
                foreach ($id as $key => $value) {
                    $model->delete(array('id'=>$value));
                    $this->AdminModel->deleteData('product_feature',array('product_id'=>$value));
                    $this->AdminModel->deleteData('product_capabilities',array('product_id'=>$value));
                    $this->AdminModel->deleteData('product_images',array('product_id'=>$value));

                    // CASCADE DELETION LAYER: Drops matching rows instantly
                    $db->table('cyb_testimonials')->where('product_id', $value)->delete();
---
DELETE FROM `cyb_testimonials`
WHERE `product_id` = '13'