app/Controllers/admin/Product.php

    public function __construct()
    {
        $settingModel = new SettingModel();
        $default_img = $settingModel->asObject()->where(array('key'=>'config_logo'))->first();
---
SELECT *
FROM `cyb_setting`
WHERE `key` = 'config_logo'
 LIMIT 1

    public function products(){
        $categogryModel = new ProductCategoryModel();
        $data['categoryList'] = $categogryModel->asObject()->where('parent',0)->findAll();

        $model = new ProductModel();
        $permission = $this->AdminModel->permission($this->uri->getSegment(2));
        if(empty($permission)){
           return  redirect()->to('admin/permission-denied');
        }

        $data['page_title'] = 'All Products List';

        $query = array();
        $like = array();
        if(!empty($_GET['type'])){
            $query['products.type'] = $_GET['type'];
        }

        if(!empty($_GET['name'])){
            $like['products.name'] = $_GET['name'];
        }

        // pagination
        $data['perPage'] = 10;
        $data['detail'] = $model->asObject()->select('products.*,sl.name as category_name')->join('categories sl','products.category_id=sl.id','left')->where($query)->like($like)->orderBy('products.id','asc')->paginate($data['perPage']);
        $data['page'] = isset($_GET['page']) ? $_GET['page'] : 0;

        $data['total'] = $model->where($query)->like($like)->countAllResults();

        $data['data'] = $model->paginate($data['perPage']);
---
SELECT *
FROM `cyb_categories`
WHERE `parent` = 0
SELECT *
FROM `cyb_products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `cyb_products`

    public function add_product($id=false)
    {
        $solutionModel = new SectorModel();
        $categogryModel = new ProductCategoryModel();
        $data['categoryList'] = $categogryModel->asObject()->where('parent',0)->findAll();

        $model = new ProductModel();
        $db = \Config\Database::connect(); // Initialize Core Database Connection Builder

        $IndustryModel = new IndustryModel();
        $data['inudstryList'] = $IndustryModel->asObject()->select('id,name')->where('status',1)->findAll();

        if(!empty($id)) {
            $data['page_title'] = ' Edit Product';
            $data['form_action'] ='admin/add_product/'.$id;
            $row = $model->asObject()->where(array('id'=>$id))->first();
---
SELECT *
FROM `cyb_categories`
WHERE `parent` = 0
SELECT `id`, `name`
FROM `cyb_industries`
WHERE `status` = 1
SELECT *
FROM `cyb_products`
WHERE `id` = '13'
 LIMIT 1

            $data['industries'] = json_decode($row->industries);

            $data['trust_strip_title'] = isset($row->trust_strip_title) ? $row->trust_strip_title : 'Trusted By Finance Teams';
            $data['trustBadgesList']   = $db->table('cyb_product_trust_badges')
                                            ->where('product_id', $row->id)
                                            ->orderBy('sort_order', 'ASC')
                                            ->get()
                                            ->getResult();
---
SELECT *
FROM `cyb_product_trust_badges`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC

            $data['capabilitiesList'] = $this->AdminModel->all_fetch('cyb_product_capabilities',array('product_id'=>$row->id));
            $data['imagesList'] = $this->AdminModel->all_fetch('cyb_product_images',array('product_id'=>$row->id));

            $data['overviewMatrixList'] = $db->table('cyb_product_overview_matrix')
                                             ->where('product_id', $row->id)
                                             ->orderBy('sort_order', 'ASC')
                                             ->get()
                                             ->getResult();

            $data['testimonialsList'] = $db->table('cyb_testimonials')
                                           ->where('product_id', $row->id)
                                           ->orderBy('sort_order', 'ASC')
                                           ->get()
                                           ->getResult();
---
SELECT *
FROM `cyb_product_overview_matrix`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC
SELECT *
FROM `cyb_testimonials`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC

            $data['partnershipTitle']       = isset($row->partnershipTitle) ? $row->partnershipTitle : 'Why Our Partnerships Matter';
            $data['partnershipDescription'] = isset($row->partnershipDescription) ? $row->partnershipDescription : '';

            $data['partnershipCardsList'] = $db->table('product_partnership_cards')
                                               ->where('product_id', $id)
                                               ->orderBy('sort_order', 'ASC')
                                               ->get()
                                               ->getResult();

            // Fetch Business Benefits (Stat Cards Matrix)
            $data['businessBenefitsList'] = $db->table('cyb_product_business_benefits')
                                               ->where('product_id', $row->id)
                                               ->orderBy('sort_order', 'ASC')
                                               ->get()
                                               ->getResult();

            // Fetch Why Choose Us Cards List
            $data['whyChooseUsList'] = $db->table('cyb_product_why_choose_us')
                                          ->where('product_id', $row->id)
                                          ->orderBy('sort_order', 'ASC')
                                          ->get()
                                          ->getResult();
---
SELECT *
FROM `cyb_product_partnership_cards`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC
SELECT *
FROM `cyb_product_business_benefits`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC
SELECT *
FROM `cyb_product_why_choose_us`
WHERE `product_id` = '13'
ORDER BY `sort_order` ASC


                if ($result) {
                    // Save Overview Matrix List
                    $db->table('cyb_product_overview_matrix')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_product_overview_matrix`
WHERE `product_id` = '13'

                    if (!empty($mLabels)) {
                        foreach ($mLabels as $idx => $mLabel) {
                            if (empty(trim($mLabel))) continue;
                            $db->table('cyb_product_overview_matrix')->insert([
                                'product_id' => $id,
                                'label'      => esc($mLabel),
                                'text'       => esc($mTexts[$idx]),
                                'sort_order' => isset($mSortOrders[$idx]) ? (int)$mSortOrders[$idx] : 0
                            ]);
---
INSERT INTO `cyb_product_overview_matrix` (`product_id`, `label`, `text`, `sort_order`) VALUES ('13', ' Financial Consolidation', 'Consolidate core multi-tier corporate financials across structural hierarchies securely.', 1)

                    }

                    // Save Partnership Cards
                    $db->table('product_partnership_cards')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_product_partnership_cards`
WHERE `product_id` = '13'

                        foreach ($pCardTitles as $idx => $pCardTitle) {
                            if (empty(trim($pCardTitle))) continue;

                            $db->table('product_partnership_cards')->insert([
                                'product_id'  => $id,
                                'title'       => esc($pCardTitle),
                                'description' => isset($pCardDescs[$idx]) ? esc($pCardDescs[$idx]) : '',
                                'icon_class'  => !empty($pCardIcons[$idx]) ? $pCardIcons[$idx] : 'fas fa-handshake',
                                'sort_order'  => isset($pCardSortOrders[$idx]) ? (int)$pCardSortOrders[$idx] : 0
                            ]);
---
INSERT INTO `cyb_product_partnership_cards` (`product_id`, `title`, `description`, `icon_class`, `sort_order`) VALUES ('13', 'Collaborative Growth ', 'Co-engineering Co-engineering solutions with industry leaders for best-in-class framework safety and innovation velocity.\r\n', 'fas fa-handshake', 1)

                    }

                    // Save Dynamic Trust Strip Badges Matrix
                    $db->table('cyb_product_trust_badges')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_product_trust_badges`
WHERE `product_id` = '13'

                    }

                    // Save Business Benefits Cards Matrix (Stat Cards)
                    $db->table('cyb_product_business_benefits')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_product_business_benefits`
WHERE `product_id` = '13'

                        foreach ($bTitles as $idx => $bTitle) {
                            if (empty(trim($bTitle))) continue;

                            $db->table('cyb_product_business_benefits')->insert([
                                'product_id'  => $id,
                                'title'       => esc($bTitle),
                                'stat_value'  => esc($bStatValues[$idx]),
                                'stat_suffix' => esc($bStatSuffix[$idx]),
                                'subtitle'    => esc($bSubtitles[$idx]),
                                'card_theme'  => esc($bThemes[$idx]),
                                'icon_class'  => !empty($bIcons[$idx]) ? esc($bIcons[$idx]) : 'fa-regular fa-clock',
                                'sort_order'  => isset($bSortOrders[$idx]) ? (int)$bSortOrders[$idx] : 0
                            ]);
---
INSERT INTO `cyb_product_business_benefits` (`product_id`, `title`, `stat_value`, `stat_suffix`, `subtitle`, `card_theme`, `icon_class`, `sort_order`) VALUES ('13', 'Reduce Closing Time', '41', '%', 'Faster month-end close', 'blue-theme', 'fa-regular fa-clock', 1)

                    }

                    // Save Why Choose Us Cards Matrix
                    $db->table('cyb_product_why_choose_us')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_product_why_choose_us`
WHERE `product_id` = '13'

                        foreach ($wTitles as $idx => $wTitle) {
                            if (empty(trim($wTitle))) continue;

                            $db->table('cyb_product_why_choose_us')->insert([
                                'product_id'  => $id,
                                'title'       => esc($wTitle),
                                'subtitle'    => esc($wSubtitles[$idx]),
                                'card_theme'  => esc($wThemes[$idx]),
                                'icon_class'  => !empty($wIcons[$idx]) ? esc($wIcons[$idx]) : 'fas fa-bolt',
                                'sort_order'  => isset($wSortOrders[$idx]) ? (int)$wSortOrders[$idx] : 0
                            ]);
---
INSERT INTO `cyb_product_why_choose_us` (`product_id`, `title`, `subtitle`, `card_theme`, `icon_class`, `sort_order`) VALUES ('13', 'Faster Financial Close', 'Reduce month-end closing timelines effortlessly.', 'blue-theme', 'fas fa-bolt', 1)

                    }

                    // Save Client Testimonials
                    $db->table('cyb_testimonials')->where('product_id', $id)->delete();
---
DELETE FROM `cyb_testimonials`
WHERE `product_id` = '13'

                                }
                            }

                            $db->table('cyb_testimonials')->insert([
                                'product_id'  => $id,
                                'name'        => esc($tName),
                                'designation' => esc($tDesignations[$idx]),
                                'description' => esc($tDescriptions[$idx]),
                                'image'       => $finalImagePath,
                                'sort_order'  => isset($tSortOrders[$idx]) ? (int)$tSortOrders[$idx] : 0,
                                'create_date' => date('Y-m-d H:i:s')
                            ]);
---
INSERT INTO `cyb_testimonials` (`product_id`, `name`, `designation`, `description`, `image`, `sort_order`, `create_date`) VALUES ('13', 'test', 'test', 'test', 'uploads/testimonials/1783510252_25378a9fe393c2e8cba4.jpg', 1, '2026-07-27 17:51:49')