app/Helpers/general_helper.php

SELECT *
FROM `cyb_setting`
WHERE `code` = 'config'
---
function websetting(){
    $db = db_connect();
    $query = $db->table('setting');
    $setting = $query->select('*')->where('code','config')->get()->getResult();