app/Models/Cms/ProductModel.php

DELETE FROM `cyb_product_feature`
WHERE `product_id` = '12'
---
    public function save_product($data)
    {
        $array = array();
        $query = $this->db->table('products');

        // Processes main project text fields alongside single files (image, thumbnail, and hero_banner)
        if (!empty($data['id'])) {
            $query->where('id', $data['id'])->update($data['info']);
            $product_id = $data['id'];
        } else {
            $query->insert($data['info']);
            $product_id = $this->db->insertID();
        }

        // Process Use Cases (Dynamic Rows)
        $query1 = $this->db->table('product_feature');
        $query1->where('product_id', $product_id)->delete();

DELETE FROM `cyb_product_capabilities`
WHERE `product_id` = '12'
---

        // Process Key Features (Dynamic Rows)
        $query2 = $this->db->table('product_capabilities');
        $query2->where('product_id', $product_id)->delete();

DELETE FROM `cyb_product_images`
WHERE `product_id` = '12'
---

        // Process Additional Images List (Dynamic Rows)
        $query3 = $this->db->table('product_images');
        $query3->where('product_id', $product_id)->delete();