app/Controllers/Frontend.php

  public function __construct()
  {

      $session = \Config\Services::session();
      // $session->get('userDetail');

         $settingModel = new SettingModel();
        $default_img = $settingModel->asObject()->where(array('key'=>'config_logo'))->first();
---
SELECT *
FROM `cyb_setting`
WHERE `key` = 'config_logo'
 LIMIT 1




     $data['blogList'] = $MediaModel->asObject()->select('blogs.id,blogs.shortDescription,blogs.thumbnail,blogs.slug,blogs.title,blog_category.name as category_name')->join('blog_category','blog_category.id=blogs.category','left')->where(['blogs.status'=>1,'feature'=>1,'type'=>'BLOG'])->findAll();


     $data['caseStudyList'] = $MediaModel->asObject()->select('blogs.id,blogs.shortDescription,blogs.thumbnail,blogs.slug,blogs.title,blogs.whitepaper_download')->where(['blogs.status'=>1,'feature'=>1,'type'=>'CASE_STUDY'])->findAll();


    $data['successStoryList'] = $MediaModel->asObject()->select('blogs.id,blogs.shortDescription,blogs.thumbnail,blogs.slug,blogs.title')->where(['blogs.status'=>1,'type'=>'SUCCESS_STORY'])->findAll(10);
---
SELECT `cyb_blogs`.`id`, `cyb_blogs`.`shortDescription`, `cyb_blogs`.`thumbnail`, `cyb_blogs`.`slug`, `cyb_blogs`.`title`, `cyb_blog_category`.`name` as `category_name`
FROM `cyb_blogs`
LEFT JOIN `cyb_blog_category` ON `cyb_blog_category`.`id`=`cyb_blogs`.`category`
WHERE `cyb_blogs`.`status` = 1
AND `feature` = 1
AND `type` = 'BLOG'
SELECT `cyb_blogs`.`id`, `cyb_blogs`.`shortDescription`, `cyb_blogs`.`thumbnail`, `cyb_blogs`.`slug`, `cyb_blogs`.`title`, `cyb_blogs`.`whitepaper_download`
FROM `cyb_blogs`
WHERE `cyb_blogs`.`status` = 1
AND `feature` = 1
AND `type` = 'CASE_STUDY'
SELECT `cyb_blogs`.`id`, `cyb_blogs`.`shortDescription`, `cyb_blogs`.`thumbnail`, `cyb_blogs`.`slug`, `cyb_blogs`.`title`
FROM `cyb_blogs`
WHERE `cyb_blogs`.`status` = 1
AND `type` = 'SUCCESS_STORY'
 LIMIT 10

function product_detail(){
    $model = new ProductModel();
    $MediaModel = new MediaModel();
    $FrontModel = new FrontModel();

    $link = $this->uri->getSegment(2);
    $meta = $model->asObject()->where(['slug'=>$link,'status'=>1])->first();
---
SELECT *
FROM `cyb_products`
WHERE `slug` = 'accounts-payable-automation'
AND `status` = 1
 LIMIT 1

public function blogs(){
   $MediaModel = new MediaModel();
    $meta = $this->AdminModel->fs('front_menu',array('link'=>$this->uri->getSegment(1),'status'=>1));
     if(empty($meta)){
        return redirect()->to('404');
    }

    $data['metaTitle'] = $meta->metaTitle;
    $data['metaDescription'] =  $meta->metaDescription;
    $data['metaKeyword'] =  $meta->metaKeyword;
    $data['meta'] =  $meta;


     $data['breadcrumbs'] = [];

    $data['breadcrumbs'][] = [
    'text' => 'Home',
    'href' => base_url(),
    'active' =>false
  ];

  $data['breadcrumbs'][] = [
    'text' => $meta->name,
    'href' => base_url($meta->link),
    'active' =>true
  ];



    $data['featureList'] = $MediaModel->asObject()->where(['status'=>1,'feature'=>1,'type'=>'BLOG'])->findAll();

   $data['blogList'] = $MediaModel->asObject()->where(['status'=>1,'feature !='=>NULL,'type'=>'BLOG'])->orderBy('id','desc')->findAll(2);
---
SELECT *
FROM `cyb_blogs`
WHERE `status` = 1
AND `feature` = 1
AND `type` = 'BLOG'
SELECT *
FROM `cyb_blogs`
WHERE `status` = 1
AND `feature` IS NOT NULL
AND `type` = 'BLOG'
ORDER BY `id` DESC
 LIMIT 2