app/Controllers/Frontend.php

SELECT *
FROM `cyb_blogs`
WHERE `status` = 1
AND `feature` = 1
AND `type` = 'BLOG'
SELECT *
FROM `cyb_blogs`
WHERE `status` = 1
AND `feature` IS NOT NULL
AND `type` = 'BLOG'
ORDER BY `id` DESC
 LIMIT 2
---
public function blogs(){
   $MediaModel = new MediaModel();
    $meta = $this->AdminModel->fs('front_menu',array('link'=>$this->uri->getSegment(1),'status'=>1));
     if(empty($meta)){
        return redirect()->to('404');
    }

    $data['metaTitle'] = $meta->metaTitle;
    $data['metaDescription'] =  $meta->metaDescription;
    $data['metaKeyword'] =  $meta->metaKeyword;
    $data['meta'] =  $meta;


     $data['breadcrumbs'] = [];

    $data['breadcrumbs'][] = [
    'text' => 'Home',
    'href' => base_url(),
    'active' =>false
  ];

  $data['breadcrumbs'][] = [
    'text' => $meta->name,
    'href' => base_url($meta->link),
    'active' =>true
  ];



    $data['featureList'] = $MediaModel->asObject()->where(['status'=>1,'feature'=>1,'type'=>'BLOG'])->findAll();

   $data['blogList'] = $MediaModel->asObject()->where(['status'=>1,'feature !='=>NULL,'type'=>'BLOG'])->orderBy('id','desc')->findAll(2);