app/Models/FrontModel.php

SELECT `bnm`.*, `bn`.`heading`, `bn`.`sub_heading`, `bn`.`description` as `banner_description`
FROM `cyb_banner` as `bn`
LEFT JOIN `cyb_banner_image` `bnm` ON `bnm`.`banner_id`=`bn`.`id`
WHERE `bn`.`slider_link` = 'footerList'
ORDER BY `bnm`.`sort_order` ASC
---
    function get_slider($link){
       $query = $this->db->table('banner as bn');
        $query->select('bnm.*,bn.heading,bn.sub_heading,bn.description as banner_description');
        $query->join('banner_image bnm','bnm.banner_id=bn.id','left');
        $query->where('bn.slider_link',$link);
          $query->orderBy('bnm.sort_order','asc');
        return $query->get()->getResult();

SELECT `id`, `name`, `thumbnail`, `slug`, `icon`
FROM `cyb_industries`
WHERE `status` = 1
AND `id` IN ('5','7','8','10')
---
   function get_industry_list($ids = array()){
       if(!empty($ids)){
         $query = $this->db->table('industries');
         $query->select('id,name,thumbnail,slug,icon');

        $query->where('status',1);

        $query->whereIn('id',$ids);
       return $query->get()->getResult();