app/Views/layouts/master.php

SELECT *
FROM `cyb_setting`
WHERE `code` = 'config'
---
<?php
use App\Models\coreModule\SettingModel;
$setmodel = new SettingModel();
$setting = $setmodel->asObject()->where('code','config')->findAll();