app/Views/frontend/includes/footer.php

SELECT *
FROM `cyb_setting`
WHERE `code` = 'config'
---
$wconfig =[];
use App\Models\coreModule\SettingModel;
$setmodel = new SettingModel();
$setting = $setmodel->asObject()->where('code','config')->findAll();

SELECT `id`, `slug`, `name`
FROM `cyb_services`
WHERE `status` = 1
ORDER BY `name` ASC
---

$menucoloum1 = $this->AdminModel->all_fetch('front_menu',array('footer'=>1,'status'=>1,'position'=>1),'sort_order_footer','asc');

$serviceList = $ServiceModel->asObject()->select('id,slug,name')->where('status',1)->orderBy('name','asc')->findAll();