app/Views/frontend/includes/header.php

SELECT *
FROM `cyb_setting`
WHERE `code` = 'config'
---
    $wconfig =[];
    use App\Models\coreModule\SettingModel;
    $setmodel = new SettingModel();
    $setting = $setmodel->asObject()->where('code','config')->findAll();